# EditGeorefWithUI

## Description
Edit the georeferenced settings of the specified layer. Pass NIL to edit the document.

```pascal
FUNCTION EditGeorefWithUI(hLayer : HANDLE) : BOOLEAN;
```

```python

def vs.EditGeorefWithUI(hLayer):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hLayer|HANDLE||

## Version
Availability: from Vectorworks 2012
## Category
* GIS